# -*- coding: utf-8 -*-
# 配合程式所使用的 @asis 會將資料存在 .leo 檔案
# 建立虛擬的班級人員名單
import random
import string
學號碼數 = 4
姓名字數 = 3
姓氏檔案 = "lastname.txt"
名字檔案 = "firstname.txt"
學生人數 = [53, 55]
# 讀進姓氏檔案與名字檔案
各班學生人數=random.randint(學生人數[0], 學生人數[1])
def makeNumber(學號碼數):
    return ''.join([random.choice(string.digits) for 索引 in range(學號碼數)])

開啟姓氏檔案 = open(姓氏檔案, "r", encoding="utf-8")
姓氏 = 開啟姓氏檔案.readlines()
開啟名字檔案 = open(名字檔案, "r", encoding="utf-8")
學員檔案 = open("虛設學員.txt","w",encoding='utf-8')
名字 = 開啟名字檔案.readlines()
科系碼 = makeNumber(學號碼數)
for 索引 in range(1, 各班學生人數):
    if(len(str(索引)) == 1):
        學號 = "0" + str(索引)
    else:
        學號 = str(索引)
    # 設法製造缺號
    if random.randint(0, 100) > 3 :
        姓 = 姓氏[0][random.randint(0, len(姓氏[0])-1)]
        名 = 名字[0][random.randint(0, len(名字[0])-1)]
        名 += 名字[0][random.randint(0, len(名字[0])-1)]
        print("90"+科系碼+學號+" "+姓+名)
        學員檔案.write("90"+科系碼+學號+" "+姓+名+"\n")

開啟姓氏檔案.close()
開啟名字檔案.close()
學員檔案.close()

'''

以下為 lastname.txt 的內容:

趙錢孫李周吳鄭王馮陳褚衛蔣沈韓楊朱秦尤許何呂施張孔曹嚴華金魏陶薑
戚謝鄒喻柏水竇章雲蘇潘葛奚範彭郎魯韋昌馬苗鳳花方俞任袁柳酆鮑史唐
費廉岑薛雷賀倪湯滕殷羅畢郝鄔安常樂於時傅皮卞齊康伍餘元蔔顧孟平黃
和穆蕭尹姚邵湛汪祁毛禹狄米貝明臧計伏成戴談宋茅龐熊紀舒屈項祝董梁
杜阮藍閔席季麻強賈路婁危江童顏郭梅盛林刁鍾徐邱駱高夏蔡田樊胡淩霍
虞萬支柯昝管盧莫柯房裘繆幹解應宗丁宣賁鄧鬱單杭洪包諸左石崔吉鈕龔
程嵇邢滑裴陸榮翁荀羊于惠甄曲家封芮羿儲靳汲邴糜松井段富巫烏焦巴弓
牧隗山穀車侯宓蓬全郗班仰秋仲伊宮甯仇欒暴甘鈄曆戎祖武符劉景詹束龍
葉幸司韶郜黎薊溥印宿白懷蒲邰從鄂索鹹籍賴卓藺屠蒙池喬陽鬱胥能蒼雙
聞莘党翟譚貢勞逄姬申扶堵冉宰酈雍卻璩桑桂濮牛壽通邊扈燕冀浦尚農溫
別莊晏柴瞿閻充慕連茹習宦艾魚容向古易慎戈廖庾終暨居衡步都耿滿弘匡
國文寇廣祿闕東歐殳沃利蔚越夔隆師鞏厙聶晁勾敖融冷訾辛闞那簡饒空曾
毋沙乜養鞠須豐巢關蒯相查後荊紅

以下為 firstname.txt 的內容:

平燦惠歡佩泰州江揚剛乃屏珊易吟定小其菱幼函琴青博兆菁重立呈然永奕
漢義萍皓力昌妍合仲佳虹慧蓮恭石展軒啟奇秀駿晉冰政綸丹邦大冠貞生思
玄威嘉依音雲英能緯彬妙聖協法瑞恆采心友昀花樺航玫宛順儀寶婷書妮胤
彥修火雨俞孝蕙允城盈家陽琳阿紹誠倫亨星美和予念鳳凱松幸凡雯士達泓
金瑜勇必珍芷岳鈺方琬成霞麟致哲台睿賢珠瑩南克為尹妤春怡亮伯喬夫昕
亞真喜初愛清禮斌吉淳百臻寧以筠諭仕子文雅郁柏秋蓉伸福劭木宗傑丞昭
芝弘宇明月峰東聿登左祥迪蘭佑甫雄俊之卉谷玲禾茹榮堯芬姍少謙琇禎蘋
年姵勳任信旭燕苓豐惟盛發齊介芳容于維侑舜洋璇茂芃伊玉海建季雪柔汝
千富男新昱人添群欣綠馨利宜堅意名右姿智韻典竹巧坤可全潔裕毓孜仁韋
慈志琦宣希云茜辛薇梅樂妏嬌安上仰長承旺珮良鑫桓瑋光貴茵憲品綺芸天
源娟輝君銘夙來昇如泉正廷峻瑤恬靖淑瑄行秉伶康水羽治妹宥夢映霖儒枝
沛香皇一龍興延翰山卿白忠恩亭俐孟均元凌又偉強育辰萱鴻宸亦娥振中紫
倩民隆善玟紋杰旻學若華豪湖帆恒佐桂蓁穎軍德財庭琪世林純岑原尚昆妃
宏
'''
